In [79]:
%matplotlib inline
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
sns.set()

@@@@@@@@@@@@@@@@@@@@@@@@@

return implicit column index by its explicit one.

explicit column index has "get_loc" method which return implicit index:

In [80]:
data = pd.DataFrame([[100, 95, 75, 44],
                   [50, 78, 89, 100],
                   [12, 23, 34, 45]], columns=["bacteria", "archaea", "viruses", "fungi"])

In [81]:
data

   bacteria  archaea  viruses  fungi
0       100       95       75     44
1        50       78       89    100
2        12       23       34     45

In [82]:
data.columns.get_loc("fungi")

3

@@@@@@@@@@@@@@@@@@@@@

rename the columns:

In [83]:
d = {"bacteria":"kingdom_1", "archaea":"kingdom_2", "viruses":"kingdom_3", "fungi":"kingdom_4" }

In [84]:
data.rename(columns={key:value for (key,value) in d.items()}, inplace=True)

In [85]:
data

   kingdom_1  kingdom_2  kingdom_3  kingdom_4
0        100         95         75         44
1         50         78         89        100
2         12         23         34         45

@@@@@@@@@@@@@@@@

rename indices

In [86]:
data.rename(index={0:"row_1", 1:"row_2", 2:"row_3"}, inplace=True)

In [87]:
data

       kingdom_1  kingdom_2  kingdom_3  kingdom_4
row_1        100         95         75         44
row_2         50         78         89        100
row_3         12         23         34         45

@@@@@@@@@@@@@

transpose the dataframe

In [88]:
data = data.T

In [89]:
data

           row_1  row_2  row_3
kingdom_1    100     50     12
kingdom_2     95     78     23
kingdom_3     75     89     34
kingdom_4     44    100     45

@@@@@@@@@@@@@@@@@@

delete the row or the column

mind the list!


axis=1 is vertical - it's a column

In [90]:
data.drop(["kingdom_3"], axis=0, inplace=True)

In [76]:
data

           row_1  row_2  row_3
kingdom_1    100     50     12
kingdom_2     95     78     23
kingdom_4     44    100     45

In [91]:
data.drop(["row_2"], axis=1, inplace=True)

In [92]:
data

           row_1  row_3
kingdom_1    100     12
kingdom_2     95     23
kingdom_4     44     45

@@@@@@@@@@@@@@@@@

make a list from row or a column

In [94]:
data.loc["kingdom_1"].tolist()

[100, 12]

In [96]:
data.loc[:,"row_1"].tolist()

[100, 95, 44]